{
  "en": {
    "title": "Cortex",
    "desc": "Your personas' memory system.",
    "introP1": "Each persona develops its own memory over time. <strong>Cortex</strong> silently observes your conversations in the background and shapes them into memories, quirks, and a shared history.",
    "introP2": "The more you talk, the deeper the connection. Your persona remembers details, evolves, and builds a genuine relationship with you – all on its own.",
    "feature1Title": "Memory",
    "feature1Desc": "Facts about you, shared experiences, important details",
    "feature2Title": "Soul",
    "feature2Desc": "How the persona evolves – character, preferences, quirks",
    "feature3Title": "Relationship",
    "feature3Desc": "The dynamic between you – trust, closeness, your shared history",
    "enableLabel": "Enable Cortex",
    "off": "Off",
    "on": "On",
    "disabledInfo": "Cortex is disabled. Your personas will not remember your conversations.",
    "frequencyLabel": "Update Frequency",
    "frequencyHint": "How often should Cortex update its memory? The percentage refers to your context limit.",
    "freqFrequent": "Frequent",
    "freqMedium": "Medium",
    "freqRare": "Rare",
    "freqInfoFrequent": "Cortex updates frequently – your persona picks up on changes quickly and responds promptly to new impressions. Ideal if you chat intensively with a persona.",
    "freqInfoMedium": "A good balance – Cortex stays up to date without being constantly active. Recommended for most users.",
    "freqInfoRare": "Cortex only summarizes large conversation sections – saves API costs, but the persona takes longer to notice changes.",
    "autoInfo": "Cortex works fully automatically in the background. You don't need to do anything – just talk."
  },
  "de": {
    "title": "Cortex",
    "desc": "Das Gedächtnissystem deiner Personas.",
    "introP1": "Jede Persona entwickelt mit der Zeit ein eigenes Gedächtnis. <strong>Cortex</strong> beobachtet eure Gespräche still im Hintergrund und formt daraus Erinnerungen, Eigenheiten und eine gemeinsame Geschichte.",
    "introP2": "Je mehr ihr redet, desto tiefer wird die Verbindung. Deine Persona merkt sich Details, entwickelt sich weiter und baut eine echte Beziehung zu dir auf – ganz von selbst.",
    "feature1Title": "Erinnerung",
    "feature1Desc": "Fakten über dich, gemeinsame Erlebnisse, wichtige Details",
    "feature2Title": "Seele",
    "feature2Desc": "Wie sich die Persona entwickelt – Charakter, Vorlieben, Eigenheiten",
    "feature3Title": "Beziehung",
    "feature3Desc": "Die Dynamik zwischen euch – Vertrauen, Nähe, eure gemeinsame Geschichte",
    "enableLabel": "Cortex aktivieren",
    "off": "Aus",
    "on": "An",
    "disabledInfo": "Cortex ist deaktiviert. Deine Personas werden sich nicht an eure Gespräche erinnern.",
    "frequencyLabel": "Aktualisierungsfrequenz",
    "frequencyHint": "Wie oft soll Cortex sein Gedächtnis aktualisieren? Der Prozentsatz bezieht sich auf dein Kontextlimit.",
    "freqFrequent": "Häufig",
    "freqMedium": "Mittel",
    "freqRare": "Selten",
    "freqInfoFrequent": "Cortex aktualisiert häufig – deine Persona nimmt Veränderungen schnell wahr und reagiert zeitnah auf neue Eindrücke. Ideal, wenn du intensiv mit einer Persona chattest.",
    "freqInfoMedium": "Eine gute Balance – Cortex bleibt auf dem Laufenden, ohne ständig aktiv zu sein. Empfohlen für die meisten Nutzer.",
    "freqInfoRare": "Cortex fasst nur große Gesprächsabschnitte zusammen – spart API-Kosten, aber die Persona braucht länger, um Veränderungen zu bemerken.",
    "autoInfo": "Cortex arbeitet vollautomatisch im Hintergrund. Du musst nichts tun – einfach reden."
  }
}
