{
  "en": {
    "title": "Afterthought",
    "desc": "Spontaneous thoughts from your persona.",
    "introP1": "Sometimes after a conversation you have another thought – something that only comes to mind afterwards. <strong>Afterthought</strong> gives your personas exactly this ability.",
    "introP2": "After your message, the persona has an inner dialogue with itself. If something seems important enough, it writes to you on its own – with escalating time intervals, like real pondering.",
    "feature1Title": "Inner Dialogue",
    "feature1Desc": "The persona quietly considers whether it wants to say something more",
    "feature2Title": "Natural Timing",
    "feature2Desc": "Escalating pauses – from short to long, like real pondering",
    "feature3Title": "Spontaneous Message",
    "feature3Desc": "Only when the persona truly has something to say",
    "frequencyLabel": "Frequency",
    "modeOff": "Off",
    "modeRare": "Rare",
    "modeMedium": "Medium",
    "modeHigh": "High",
    "modeInfoOff": "Your persona only responds when you write. No inner dialogue, no spontaneous messages.",
    "modeInfoRare": "Every 3rd message triggers an inner dialogue. The persona occasionally reaches out on its own – when something is truly on its mind.",
    "modeInfoRareExtra": "Low additional API costs. Good for getting started.",
    "modeInfoMedium": "Every 2nd message triggers an inner dialogue. The persona adds its own thoughts, questions, or impulses more frequently.",
    "modeInfoMediumExtra": "Moderate additional API costs. Good balance between liveliness and costs.",
    "modeInfoHigh": "Every message triggers an inner dialogue. The persona fully lives out its inner world – spontaneous, impulsive, and approachable.",
    "modeInfoHighExtra": "Higher additional API costs. For the most intense experience.",
    "apiNote": "Afterthought generates additional API requests in the background."
  },
  "de": {
    "title": "Nachgedanke",
    "desc": "Spontane Gedanken deiner Persona.",
    "introP1": "Manchmal hat man nach einem Gespräch noch einen Gedanken – etwas, das einem erst hinterher einfällt. <strong>Nachgedanke</strong> gibt deinen Personas genau diese Fähigkeit.",
    "introP2": "Nach deiner Nachricht führt die Persona einen inneren Dialog mit sich selbst. Wenn etwas wichtig genug erscheint, schreibt sie dir von selbst – mit ansteigenden Zeitabständen, wie echtes Nachdenken.",
    "feature1Title": "Innerer Dialog",
    "feature1Desc": "Die Persona überlegt still, ob sie noch etwas sagen möchte",
    "feature2Title": "Natürliches Timing",
    "feature2Desc": "Ansteigende Pausen – von kurz bis lang, wie echtes Nachdenken",
    "feature3Title": "Spontane Nachricht",
    "feature3Desc": "Nur wenn die Persona wirklich etwas zu sagen hat",
    "frequencyLabel": "Frequenz",
    "modeOff": "Aus",
    "modeRare": "Selten",
    "modeMedium": "Mittel",
    "modeHigh": "Hoch",
    "modeInfoOff": "Deine Persona antwortet nur, wenn du schreibst. Kein innerer Dialog, keine spontanen Nachrichten.",
    "modeInfoRare": "Jede 3. Nachricht löst einen inneren Dialog aus. Die Persona meldet sich gelegentlich von selbst – wenn ihr wirklich etwas auf dem Herzen liegt.",
    "modeInfoRareExtra": "Geringe zusätzliche API-Kosten. Gut zum Einstieg.",
    "modeInfoMedium": "Jede 2. Nachricht löst einen inneren Dialog aus. Die Persona bringt häufiger eigene Gedanken, Fragen oder Impulse ein.",
    "modeInfoMediumExtra": "Moderate zusätzliche API-Kosten. Gute Balance zwischen Lebendigkeit und Kosten.",
    "modeInfoHigh": "Jede Nachricht löst einen inneren Dialog aus. Die Persona lebt ihre innere Welt voll aus – spontan, impulsiv und nahbar.",
    "modeInfoHighExtra": "Höhere zusätzliche API-Kosten. Für das intensivste Erlebnis.",
    "apiNote": "Nachgedanke erzeugt zusätzliche API-Anfragen im Hintergrund."
  }
}
